tap "homebrew/cask-font"

# specify a directory to install
cask_args appdir: '/Applications'

# install packages
brew 'openssl'
brew 'rbenv'
brew 'mas'

# Casks
cask 'java' unless system "/usr/libexec/java_home --failfast"
cask 'google-chrome'
cask 'dropbox'
cask 'skype'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
#cask 'slack'
cask 'Dash'
cask 'iterm2'
cask 'sourcetree'
cask 'android-studio'

cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "quicklookapk"

# cask-font
cask "font-meslo-for-powerline"

# Mac App Store
# mas "1Password 7", id: 1333542190
# mas "Slack", id: 803453959
